In [1]:
import pandas as pd

In [2]:
d = {
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}
df = pd.DataFrame(d)

In [3]:
df.head()

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

 1. 创建变量r1 = 将df中所有大于3的值乘方，其他值不变

In [4]:
r1 = df.copy()
r1[r1>3] *=3

In [5]:
print(r1)

   one   two
a  1.0   1.0
b  2.0   2.0
c  3.0   3.0
d  NaN  12.0

2. 创建变量r2 = df中含有1或4的行

In [6]:
r2 = df.copy()

In [7]:
print(r2)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [8]:
r2[(r2['one'] == 1) | (r2['two'] == 4)]

   one  two
a  1.0  1.0
d  NaN  4.0

3. 创建变量r3 = df中随机一列

In [9]:
r3_1 = df.T

In [10]:
r3_1.head()

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0

In [11]:
r3 = r3_1.sample()

In [12]:
r3.T

   one
a  1.0
b  2.0
c  3.0
d  NaN

4. 创建变量r4 = 在df的基础上添加一列add：值为列one与列two的值相加应该如何实现

In [13]:
r4 = df.copy()
r4.fillna(0)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

In [14]:
r4['add'] =r4['one']  +  r4['two']

In [15]:
r4.head()

   one  two  add
a  1.0  1.0  2.0
b  2.0  2.0  4.0
c  3.0  3.0  6.0
d  NaN  4.0  NaN

5. 创建变量r5 = df中one列>2的行

In [16]:
r5_1 = df.copy()

In [17]:
r5 = r5_1[r5_1['one']>2]

In [18]:
print(r5)

   one  two
c  3.0  3.0